function w = w(D,p)
%Рассчитывает волновые функции w по формуле с параметрами D в точках p

D = reshape(D,1,[]);
p = reshape(p,[],1);

n = numel(D) + 3;
j = 1:n;
m = 0.231607 + (j-1).*0.9;
D = [D, zeros(1,3)];
for i = n-2:n
    D(i) = m(n-2).^2./((m(n).^2 - m(n-2).^2).*(m(n-1).^2 - m(n-2).^2)) .* ( ...
        -m(n-1).^2.*m(n).^2.*sum(D(1:n-3)./m(1:n-3).^2) + ...
        (m(n-1).^2 + m(n).^2).*sum(D(1:n-3)) - ...
        sum(D(1:n-3).*m(1:n-3).^2) ...
        );
    m(n-2:n) = circshift(m(n-2:n),-1);
end
w = sqrt(2./pi).*sum(D./(p.^2+m.^2),2);