function w_j = w_a_j(n,j,p)
%Рассчитывает j-ый линейный компонент (из n) волновой функции w в точках p

m_0 = 0.9;
gamma = 0.231607;

m_j = gamma + (j - 1).*m_0;
m_n = gamma + ((n-2:n) - 1).*m_0;
w_j = 1./(p.^2+m_j.^2);
for i = 1:3
    w_j = w_j + ...
        m_n(1).^2./((m_n(3).^2 - m_n(1).^2).*(m_n(2).^2 - m_n(1).^2)) .* ...
        (-m_n(2).^2.*m_n(3).^2./m_j.^2 + (m_n(2).^2 + m_n(3).^2) - m_j.^2) ./ ...
        (p.^2 + m_n(1).^2);
    m_n = circshift(m_n,-1);
end
w_j = sqrt(2./pi).*w_j;